### IP

- 인터넷에 연결되어 있는 모든 컴퓨터가 가지고있는 고유의 주소
- 8비트 크기의 4개의 필드를 이용함 ex) [xxx.xxx.xxx.xxx](http://xxx.xxx.xxx.xxx) → IP version4
- 8비트(1바이트)는 0~255 까지의 수를 가진다. 약 43억개의 조합이 나옴

네트워크가 분리되면, 라우터가 있어야 통신할 수 있다.

### IP주소 체계

**classful address**

- 네트워크 주소와 호스트 주소로 구분
- 네트워크 ID : 라우터가 없이 통신 가능한 네트워크, 각 호스트가 속한 네트워크를 대표
- 호스트 ID : 실제 사용한 주소, 네트워크 주소로 표현되는 네트워크 내부에서 각 호스트의 주소를 표현, 네트워크 주소를 제외한 나머지 이다.

![https://user-images.githubusercontent.com/70089259/148165982-233d3c1e-166d-4c30-b417-fcaa76df54b0.png](https://user-images.githubusercontent.com/70089259/148165982-233d3c1e-166d-4c30-b417-fcaa76df54b0.png)

**NAT(network address translation) - 사설 주소**

공통 주소(공인IP)로 들어오고 나가지만, 내부에서 사용할 수 있도록 NAT라는 기계를 이용해서 사설IP로 바꾸어서 사용. 공인IP는 사설 IP를 가지지 못한다. 라우터로 봐도 된다.

같은 네트워크가 아니라면 사설 주소를 자유롭게 이용한다.

![https://user-images.githubusercontent.com/70089259/148169513-01eb1723-7088-4fca-a587-08b73e611b1e.png](https://user-images.githubusercontent.com/70089259/148169513-01eb1723-7088-4fca-a587-08b73e611b1e.png)

### 서브넷 마스크

classful address는 그대로 사용하기에 불편하고 낭비가 심하다.

기존의 방법을 깨버리는 서브넷팅이라는 방법이 나온다.

192.168.30.0이라는 네트워크는 호스트를 256 -2 개 가진다.

구간 : 192.168.30.0~192.168.30.255  → prefix : 24

prefix를 하나 씩 늘릴 때마다 호스트 수가 절반으로 줄면서 네트워크를 늘린다.

192.168.30.0~192.168.30.127

192.168.30.128~192.168.30.255

![https://user-images.githubusercontent.com/70089259/148172362-22b20c77-024f-4b1b-8a55-0b87ecb98070.png](https://user-images.githubusercontent.com/70089259/148172362-22b20c77-024f-4b1b-8a55-0b87ecb98070.png)

**정의**
네트워크를 분리 및 합치는 개념

**호스트 개수**

2^(32-prefix) - 2

**구간 구하기**

192.168.100.0/28

2^(32-28) = 16 - 2 = 14, 256/16 = 16

192.168.100.0 ~ 192.168.100.1s

192.168.100.16 ~ 192.168.100.31
